Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/TOUCHSCREEN/touchscreen.c
/**
  ******************************************************************************
  * @file    touchscreen.c
  * @brief   STMPE811 Touchscreen driver implementation for STM32F429 Discovery Board
  * @details This file provides the implementation of touchscreen functions
  *          for the STMPE811 resistive touchscreen controller.
  * @version 1.0
  * @date    2025-09-04
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "touchscreen.h"
#include "i2c.h"
#include "stdbool.h"
#include <stdint.h>
#include <string.h>
#include <math.h>
#include <stdlib.h>
#include "log.h"
#include "stm32f4xx_hal_gpio.h"

/* Private constants ---------------------------------------------------------*/
#define TS_DELAY_MS(x)                  HAL_Delay(x)
#define TS_GESTURE_THRESHOLD            20      /* Minimum movement for gesture */
#define TS_LONG_PRESS_TIME              1000    /* Minimum time for long press (ms) */
#define TS_PRESSURE_THRESHOLD           2      /* Default pressure threshold */
#define TS_DEFAULT_MIN_COORD            200     /* Default minimum coordinate */
#define TS_DEFAULT_MAX_COORD            3900    /* Default maximum coordinate */
#define TS_ADC_CTRL_12BIT               0x49    /* 12-bit ADC configuration (BSP value) */

/* Pressure scaling */
#define TS_PRESSURE_MAX_VALUE           0xFFU
#define TS_PRESSURE_SCALE               255U
#define TS_BYTE_MASK                    0xFFU

/* Measured raw bounds (replace with your actual measured values).
   NOTE: On this panel smaller raw X corresponds to the RIGHT side of the display,
   and smaller raw Y corresponds to the BOTTOM of the display (hence mappings are inverted). */
#define TS_RAW_X_MIN 301   // observed small raw X (right edge)
#define TS_RAW_X_MAX 3796  // observed large raw X (left edge)
#define TS_RAW_Y_MIN 151   // observed small raw Y (bottom edge)
#define TS_RAW_Y_MAX 3605  // observed large raw Y (top edge)


/* Private variables ---------------------------------------------------------*/
/* Global touchscreen handle */
TS_HandleTypeDef *g_hts = NULL;

/* Private function prototypes -----------------------------------------------*/

static TS_StatusTypeDef TS_InitI2C(TS_HandleTypeDef *hts);
static TS_StatusTypeDef TS_CheckDevice(TS_HandleTypeDef *hts);
static TS_StatusTypeDef TS_ConfigureController(TS_HandleTypeDef *hts);
static TS_StatusTypeDef TS_ReadRawCoordinates(uint16_t *raw_x,
                                              uint16_t *raw_y,
                                              uint16_t *pressure);

static TS_StatusTypeDef TS_ConvertCoordinates(uint16_t raw_x,
                                              uint16_t raw_y,
                                              uint16_t *disp_x,
                                              uint16_t *disp_y);
static void TS_FilterCoordinates(uint16_t *x,
                                 uint16_t *y);
static TS_GestureTypeDef TS_AnalyzeGesture(TS_HandleTypeDef *hts);

 static int32_t map(int32_t val,
                   int32_t in_min, int32_t in_max,
                   int32_t out_min, int32_t out_max);

/* Helper: integer-safe linear mapping with input clamping. Handles inverted output ranges. */
static int32_t map(int32_t val,
                   int32_t in_min, int32_t in_max,
                   int32_t out_min, int32_t out_max)
{
    if (in_max == in_min) return out_min; /* avoid divide by zero */

    /* Clamp input to expected raw range */
    if (val < in_min) val = in_min;
    if (val > in_max) val = in_max;

    int64_t in_range = (int64_t)(in_max - in_min);
    int64_t out_range = (int64_t)(out_max - out_min);

    int64_t scaled = (int64_t)(val - in_min) * out_range;
    int32_t result = (int32_t)(scaled / in_range + out_min);

    return result;
}

/* Exported functions --------------------------------------------------------*/

/**
 * @brief Initialize touchscreen system
 * @param hts Pointer to touchscreen handle structure
 * @param hi2c Pointer to I2C handle
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_Init(TS_HandleTypeDef *hts, I2C_HandleTypeDef *hi2c)
{
    TS_StatusTypeDef status = TS_OK;

    /* Check parameters */
    if (hts == NULL || hi2c == NULL) {
        return TS_INVALID_PARAM;
    }

    /* Initialize structure */
    memset(hts, 0, sizeof(TS_HandleTypeDef));
    hts->hi2c = hi2c;
    g_hts = hts;

    /* Initialize I2C peripheral */
    status = TS_InitI2C(hts);
    if (status != TS_OK) {
        return status;
    }

    /* Check if device is present */
    status = TS_CheckDevice(hts);
    if (status != TS_OK) {
        return status;
    }

    /* Set default configuration */
    TS_ConfigTypeDef default_config = TS_GetDefaultConfig();
    status = TS_Configure(hts, &default_config);
    if (status != TS_OK) {
        return status;
    }



    /* Configure STMPE811 controller */
    status = TS_ConfigureController(hts);
    if (status != TS_OK) {
        return status;
    }

    /* Polling-only mode: keep touchscreen interrupts disabled */
    TS_EnableInterrupt(hts, false);

    hts->IsInitialized = true;
    return TS_OK;
}

/**
 * @brief Deinitialize touchscreen system
 * @param hts Pointer to touchscreen handle structure
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_DeInit(TS_HandleTypeDef *hts)
{
    if (hts == NULL) {
        return TS_INVALID_PARAM;
    }

    /* Disable interrupts (polling-only) */
    TS_EnableInterrupt(hts, false);

    /* Disable touchscreen controller */
    TS_WriteRegister(hts, STMPE811_REG_SYS_CTRL2, STMPE811_SYS_CTRL2_TSC_OFF);

    /* Reset structure */
    hts->IsInitialized = false;
    g_hts = NULL;

    return TS_OK;
}

/**
 * @brief Configure touchscreen parameters
 * @param hts Pointer to touchscreen handle structure
 * @param config Pointer to configuration structure
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_Configure(TS_HandleTypeDef *hts, TS_ConfigTypeDef *config)
{
    if (hts == NULL || config == NULL) {
        return TS_INVALID_PARAM;
    }

    /* Store configuration */
    hts->Config = *config;

    return TS_OK;
}

/**
 * @brief Reset touchscreen controller
 * @param hts Pointer to touchscreen handle structure
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_Reset(TS_HandleTypeDef *hts)
{
    if (hts == NULL) {
        return TS_INVALID_PARAM;
    }

    /* Software reset */
    TS_WriteRegister(hts, STMPE811_REG_SYS_CTRL1, 0x02);
    TS_DELAY_MS(5);
    TS_WriteRegister(hts, STMPE811_REG_SYS_CTRL1, 0x00);
    TS_DELAY_MS(2);

    return TS_OK;
}

/**
 * @brief Get current touch data
 * @param hts Pointer to touchscreen handle structure
 * @param touch_data Pointer to store touch data
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_GetTouchData(TS_HandleTypeDef *hts, TS_TouchDataTypeDef *touch_data)
{
    if (hts == NULL || touch_data == NULL) {
        return TS_INVALID_PARAM;
    }

    *touch_data = hts->TouchData;

    return TS_OK;
}

/**
 * @brief Get single touch coordinates
 * @param hts Pointer to touchscreen handle structure
 * @param xPos Pointer to store X coordinate
 * @param yPos Pointer to store Y coordinate
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_GetSingleTouch(TS_HandleTypeDef *hts,
                                  uint16_t *xPos,
                                  uint16_t *yPos)
{
    uint16_t raw_x = 0;
    uint16_t raw_y = 0;
    uint16_t disp_x = 0;
    uint16_t disp_y = 0;

