Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/TOUCHSCREEN/touchscreen.c
    if(hts == NULL || xPos == NULL || yPos == NULL) {
        return TS_INVALID_PARAM;
    }

    *xPos = 0;
    *yPos = 0;
    uint8_t fifo_size = 0;
    uint8_t status = 0;

    if(!hts->IsInitialized) {
        return TS_NOT_INITIALIZED;
    }

    if (TS_ReadRegister(hts, STMPE811_REG_TSC_CTRL, &status) != TS_OK ) {
        return TS_ERROR;
    }

    if (status & (uint8_t)STMPE811_TS_CTRL_STATUS)
    {
        if (TS_ReadRegister(hts, STMPE811_REG_FIFO_SIZE, &fifo_size) != TS_OK) return TS_ERROR;
    }
    else {

        /* Reset FIFO (mandatory after reading) */
        TS_WriteRegister(g_hts, STMPE811_REG_FIFO_STA, 0x01);
        TS_WriteRegister(g_hts, STMPE811_REG_FIFO_STA, 0x00);
        return TS_ERROR;
    }


    if(TS_ReadRawCoordinates(&raw_x, &raw_y, NULL) != TS_OK) {
        return TS_ERROR;
    }

    if(TS_ConvertCoordinates(raw_x, raw_y, &disp_x, &disp_y) != TS_OK) {
        return TS_ERROR;
    }

    TS_FilterCoordinates(&disp_x, &disp_y);

    *xPos = disp_x;
    *yPos = disp_y;

    return TS_OK;
}


TS_StatusTypeDef TS_GetTouchState(TS_HandleTypeDef *hts,
                                 uint16_t *x,
                                 uint16_t *y,
                                 uint8_t *pressed)
{
    uint16_t raw_x = 0;
    uint16_t raw_y;
    uint16_t disp_x;
    uint16_t disp_y;

    if(hts == NULL || x == NULL || y == NULL || pressed == NULL) {
        return TS_INVALID_PARAM;
    }

    *pressed = 0;
    *x = 0;
    *y = 0;

    if(!hts->IsInitialized) {
        return TS_NOT_INITIALIZED;
    }

    if(TS_ReadRawCoordinates(&raw_x, &raw_y, NULL) != TS_OK) {
        return TS_OK;
    }

    if(TS_ConvertCoordinates(raw_x, raw_y, &disp_x, &disp_y) != TS_OK) {
        return TS_OK;
    }

    TS_FilterCoordinates(&disp_x, &disp_y);

    *x = disp_x;
    *y = disp_y;
    *pressed = 1;

    return TS_OK;
}



/**
 * @brief Check if touchscreen is currently touched
 * @param hts Pointer to touchscreen handle structure
 * @retval bool True if touched (FIFO has data)
 */
bool TS_IsTouched(TS_HandleTypeDef *hts)
{
    if (hts == NULL || !hts->IsInitialized) {
        return false;
    }

    uint8_t fifo_size = 0;
    if (TS_ReadRegister(hts, STMPE811_REG_FIFO_SIZE, &fifo_size) != TS_OK) {
        return false;
    }

    return (fifo_size > 0);
}

/**
 * @brief Get number of active touches
 * @param hts Pointer to touchscreen handle structure
 * @retval uint8_t Number of touches
 */
uint8_t TS_GetTouchCount(TS_HandleTypeDef *hts)
{
    if (hts == NULL) {
        return 0;
    }

    return hts->TouchData.TouchCount;
}

/**
 * @brief Calibrate touchscreen
 * @param hts Pointer to touchscreen handle structure
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_Calibrate(TS_HandleTypeDef *hts)
{
    if (hts == NULL) {
        return TS_INVALID_PARAM;
    }

    /* Basic calibration - in a real implementation, this would
       involve displaying calibration points and collecting user input */

    hts->Calibration.MinX = TS_DEFAULT_MIN_COORD;
    hts->Calibration.MaxX = TS_DEFAULT_MAX_COORD;
    hts->Calibration.MinY = TS_DEFAULT_MIN_COORD;
    hts->Calibration.MaxY = TS_DEFAULT_MAX_COORD;
    hts->Calibration.ScaleX = (float)TS_DISPLAY_WIDTH / (float)(hts->Calibration.MaxX - hts->Calibration.MinX);
    hts->Calibration.ScaleY = (float)TS_DISPLAY_HEIGHT / (float)(hts->Calibration.MaxY - hts->Calibration.MinY);
    hts->Calibration.OffsetX = (int16_t)(-hts->Calibration.MinX);
    hts->Calibration.OffsetY = (int16_t)(-hts->Calibration.MinY);
    hts->Calibration.IsCalibrated = true;

    return TS_OK;
}

/**
 * @brief Set calibration data
 * @param hts Pointer to touchscreen handle structure
 * @param calibration Pointer to calibration data
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_SetCalibration(TS_HandleTypeDef *hts, TS_CalibrationTypeDef *calibration)
{
    if (hts == NULL || calibration == NULL) {
        return TS_INVALID_PARAM;
    }

    hts->Calibration = *calibration;

    return TS_OK;
}

/**
 * @brief Get calibration data
 * @param hts Pointer to touchscreen handle structure
 * @param calibration Pointer to store calibration data
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_GetCalibration(TS_HandleTypeDef *hts, TS_CalibrationTypeDef *calibration)
{
    if (hts == NULL || calibration == NULL) {
        return TS_INVALID_PARAM;
    }

    *calibration = hts->Calibration;

    return TS_OK;
}

/**
 * @brief Enable/disable interrupt
 * @param hts Pointer to touchscreen handle structure
 * @param enable Enable/disable flag
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_EnableInterrupt(TS_HandleTypeDef *hts, bool enable)
{
    if (hts == NULL) {
        return TS_INVALID_PARAM;
    }

    if (enable) {
        log_debug("TS: Enabling touchscreen interrupt");
        /* Enable touch detection interrupt */
        TS_WriteRegister(hts, STMPE811_REG_INT_EN, STMPE811_INT_EN_TOUCH_DET);
        TS_WriteRegister(hts, STMPE811_REG_INT_CTRL, STMPE811_INT_CTRL_POL_LOW | STMPE811_INT_CTRL_ENABLE);
    } else {
        /* Disable interrupts */
        TS_WriteRegister(hts, STMPE811_REG_INT_EN, 0x00);
        TS_WriteRegister(hts, STMPE811_REG_INT_CTRL, STMPE811_INT_CTRL_DISABLE);
    }

    hts->InterruptMode = enable;

    return TS_OK;
}

/**
 * @brief Configure interrupt
 * @param hts Pointer to touchscreen handle structure
 * @retval TS_StatusTypeDef Status of the operation
 */
/**
 * @brief Interrupt handler
 * @param hts Pointer to touchscreen handle structure
 */
void TS_IRQHandler(TS_HandleTypeDef *hts)
{
    if (hts == NULL) {
        return;
    }

    uint8_t int_status = 0;

    /* Read interrupt status */
    TS_ReadRegister(hts, STMPE811_REG_INT_STA, &int_status);

    if (int_status & STMPE811_INT_EN_TOUCH_DET) {
        /* Touch detected - callbacks can be handled here if needed */
        /* Note: TS_ProcessTouchData removed as TS_GetSingleTouch handles everything */

        /* Call callbacks if registered (for other purposes) */
        if (hts->TouchCallback != NULL) {
            hts->TouchCallback();
        }

        /* Detect gestures if needed */
        TS_GestureTypeDef gesture = TS_AnalyzeGesture(hts);
        if (gesture != TS_GESTURE_NONE && hts->GestureCallback != NULL) {
            hts->GestureCallback(gesture);
        }
    }

