Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/TOUCHSCREEN/touchscreen.c
    /* Clear interrupt */
    TS_WriteRegister(hts, STMPE811_REG_INT_STA, int_status);
}

/**
 * @brief Service pending touchscreen IRQ outside ISR context
 * @details Clears STMPE811 interrupt and invokes callbacks safely from thread context
 */
/**
 * @brief Register callback functions
 * @param hts Pointer to touchscreen handle structure
 * @param touch_callback Touch detected callback
 * @param release_callback Touch released callback
 * @param gesture_callback Gesture detected callback
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_RegisterCallbacks(TS_HandleTypeDef *hts,
                                     void (*touch_callback)(void),
                                     void (*release_callback)(void),
                                     void (*gesture_callback)(TS_GestureTypeDef))
{
    if (hts == NULL) {
        return TS_INVALID_PARAM;
    }

    hts->TouchCallback = touch_callback;
    hts->ReleaseCallback = release_callback;
    hts->GestureCallback = gesture_callback;

    return TS_OK;
}

/**
 * @brief Convert raw touchscreen coordinates to display coordinates
 * @param raw_x Raw X coordinate
 * @param raw_y Raw Y coordinate
 * @param disp_x Pointer to store display X coordinate
 * @param disp_y Pointer to store display Y coordinate
 * @retval TS_StatusTypeDef Status of the operation
 */

static TS_StatusTypeDef TS_ConvertCoordinates(uint16_t raw_x,
                                              uint16_t raw_y,
                                              uint16_t *disp_x,
                                              uint16_t *disp_y)
{
    if(disp_x == NULL || disp_y == NULL) {
        return TS_INVALID_PARAM;
    }

    /* Use linear mapping between measured raw ranges and display coords.
       Small raw_x -> RIGHT side of display (inverted X).
       Small raw_y -> BOTTOM of display (inverted Y).
       The 'map' helper clamps inputs and performs integer-safe scaling. */
    int32_t xr = map((int32_t)raw_x, (int32_t)TS_RAW_X_MIN, (int32_t)TS_RAW_X_MAX,
                     (int32_t)(TS_DISPLAY_WIDTH - 1), 0);

    int32_t yr = map((int32_t)raw_y, (int32_t)TS_RAW_Y_MIN, (int32_t)TS_RAW_Y_MAX,
                     (int32_t)(TS_DISPLAY_HEIGHT - 1), 0);

    /* Clamp to display bounds */
    if (xr < 0) xr = 0;
    else if (xr >= TS_DISPLAY_WIDTH) xr = TS_DISPLAY_WIDTH - 1;

    if (yr < 0) yr = 0;
    else if (yr >= TS_DISPLAY_HEIGHT) yr = TS_DISPLAY_HEIGHT - 1;

    *disp_x = (uint16_t)xr;
    *disp_y = (uint16_t)yr;

    return TS_OK;
}


/**
 * @brief Read register from STMPE811
 * @param hts Pointer to touchscreen handle structure
 * @param reg Register address
 * @param data Pointer to store data
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_ReadRegister(TS_HandleTypeDef *hts, uint8_t reg, uint8_t *data)
{
    if (hts == NULL || data == NULL) {
        return TS_INVALID_PARAM;
    }

    if (I2C_Mem_Read(STMPE811_I2C_ADDRESS, reg, I2C_MEMADD_SIZE_8BIT, data, 1, TS_TIMEOUT) != I2C_OK) {
        return TS_COMMUNICATION_ERROR;
    }

    return TS_OK;
}

/**
 * @brief Write register to STMPE811
 * @param hts Pointer to touchscreen handle structure
 * @param reg Register address
 * @param data Data to write
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_WriteRegister(TS_HandleTypeDef *hts, uint8_t reg, uint8_t data)
{
    if (hts == NULL) {
        return TS_INVALID_PARAM;
    }

    if (I2C_Mem_Write(STMPE811_I2C_ADDRESS, reg, I2C_MEMADD_SIZE_8BIT, &data, 1, TS_TIMEOUT) != I2C_OK) {
        return TS_COMMUNICATION_ERROR;
    }

    return TS_OK;
}


/**
 * @brief Read 16-bit register from STMPE811
 * @param hts Pointer to touchscreen handle structure
 * @param reg Register address
 * @param data Pointer to store data
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_ReadRegister16(TS_HandleTypeDef *hts, uint8_t reg, uint16_t *data)
{
    if (hts == NULL || data == NULL) {
        return TS_INVALID_PARAM;
    }

    uint8_t buffer[2];
    if (I2C_Mem_Read(STMPE811_I2C_ADDRESS, reg, I2C_MEMADD_SIZE_8BIT, buffer, 2, TS_TIMEOUT) != I2C_OK) {
        return TS_COMMUNICATION_ERROR;
    }

    *data = (buffer[0] << 8) | buffer[1];

    return TS_OK;
}

/**
 * @brief Write 16-bit data to touchscreen register
 * @param hts Pointer to touchscreen handle
 * @param reg Register address
 * @param data Data to write
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_WriteRegister16(TS_HandleTypeDef *hts, uint8_t reg, uint16_t data)
{
    if (hts == NULL) {
        return TS_INVALID_PARAM;
    }

    uint8_t buffer[2];
    buffer[0] = (uint8_t)(data >> 8);   // MSB first
    buffer[1] = (uint8_t)(data & TS_BYTE_MASK); // LSB

    if (I2C_Mem_Write(STMPE811_I2C_ADDRESS, reg, I2C_MEMADD_SIZE_8BIT, buffer, 2, TS_TIMEOUT) != I2C_OK) {
        return TS_COMMUNICATION_ERROR;
    }

    return TS_OK;
}

/**
 * @brief Read multiple bytes from touchscreen register with error recovery
 * @details Reads a block of data from STMPE811 registers using I2C with automatic
 *          bus recovery on communication failures for improved reliability.
 * @param hts Pointer to touchscreen handle
 * @param reg Starting register address
 * @param data Pointer to data buffer to store read bytes
 * @param size Number of bytes to read
 * @retval TS_StatusTypeDef TS_OK on success, TS_INVALID_PARAM for bad inputs,
 *                         TS_COMMUNICATION_ERROR on I2C failure
 */
TS_StatusTypeDef TS_ReadRegisterMulti(TS_HandleTypeDef *hts, uint8_t reg, uint8_t *data, uint16_t size)
{
    if (hts == NULL || data == NULL || size == 0) {
        return TS_INVALID_PARAM;
    }

    if (I2C_Mem_Read_Multi(STMPE811_I2C_ADDRESS, reg, I2C_MEMADD_SIZE_8BIT, data, size, TS_TIMEOUT) != I2C_OK) {
        return TS_COMMUNICATION_ERROR;
    }

    return TS_OK;
}

/**
 * @brief Get pressure value from touchscreen
 * @param hts Pointer to touchscreen handle
 * @param pressure Pointer to store pressure value
 * @retval TS_StatusTypeDef Status of the operation
 */
TS_StatusTypeDef TS_GetPressure(TS_HandleTypeDef *hts, uint16_t *pressure)
{
    if (hts == NULL || pressure == NULL) {
        return TS_INVALID_PARAM;
    }

