Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/TOUCHSCREEN/touchscreen.c
    uint8_t data = 0;

    /* Read pressure data from Z register */
    if (TS_ReadRegister(hts, STMPE811_REG_TSC_DATA_Z, &data) != TS_OK) {
        return TS_COMMUNICATION_ERROR;
    }

    /* Convert to 16-bit pressure value */
    *pressure = (uint16_t)data;

    /* Apply pressure scaling if needed */
    if (*pressure > 0) {
        *pressure = (uint16_t)((*pressure * TS_PRESSURE_SCALE) / TS_PRESSURE_MAX_VALUE);
    }

    return TS_OK;
}

/**
 * @brief Get default configuration
 * @retval TS_ConfigTypeDef Default configuration
 */
TS_ConfigTypeDef TS_GetDefaultConfig(void)
{
    TS_ConfigTypeDef config = {
        .SampleTime = STMPE811_TSC_CFG_4_SAMPLE,
        .AverageControl = STMPE811_TSC_CFG_DELAY_1MS,
        .TouchDetectDelay = STMPE811_TSC_CFG_SETTLE_1MS,
        .PanelDriverSettlingTime = STMPE811_TSC_CFG_SETTLE_1MS,
        .PressureThreshold = TS_PRESSURE_THRESHOLD,
        .InterruptEnable = false,
        .FIFOEnable = true,
        .FIFOThreshold = 1
    };

    return config;
}

/* Private functions ---------------------------------------------------------*/


/**
 * @brief Initialize I2C peripheral
 * @param hts Pointer to touchscreen handle structure
 * @retval TS_StatusTypeDef Status of the operation
 */
static TS_StatusTypeDef TS_InitI2C(TS_HandleTypeDef *hts)
{
    /* If application already provided an I2C handle, assume it's configured and ready.
       Otherwise use the central I2C driver (I2C_Init which configures hi2c3) */
    if (hts->hi2c->Instance == NULL) {
        I2C_Init(); /* initializes hi2c3 */
        hts->hi2c = &hi2c3; /* use central handle */
    }

    return TS_OK;
}

/**
 * @brief Check if STMPE811 device is present
 * @param hts Pointer to touchscreen handle structure
 * @retval TS_StatusTypeDef Status of the operation
 */
static TS_StatusTypeDef TS_CheckDevice(TS_HandleTypeDef *hts)
{
    uint16_t device_id = 0;

    /* Check that device responds on I2C bus before reading registers */
    if (I2C_IsDeviceReady(STMPE811_I2C_ADDRESS, 3, 100) != I2C_OK) {
        log_debug("TS: Device not found on I2C bus");
        return TS_DEVICE_NOT_FOUND;
    }

    if (TS_ReadRegister16(hts, STMPE811_REG_CHIP_ID, &device_id) != TS_OK) {
        log_debug("TS: Failed to read device ID");
        return TS_DEVICE_NOT_FOUND;
    }

    if (device_id != STMPE811_CHIP_ID) {
        log_debug("TS: Device ID mismatch");
        return TS_DEVICE_NOT_FOUND;
    }

    hts->DeviceID = device_id;
    log_debug("TS: Device found, ID: 0x%04X", device_id);
    return TS_OK;
}

/**
 * @brief Configure STMPE811 controller
 * @param hts Pointer to touchscreen handle structure
 * @retval TS_StatusTypeDef Status of the operation
 * @note Configuration sequence based on ST BSP STMPE811_TS_Init()
 */
static TS_StatusTypeDef TS_ConfigureController(TS_HandleTypeDef *hts)
{
    uint8_t tmp = 0;

    /* Reset the device */
    TS_Reset(hts);

    TS_ReadRegister(hts, STMPE811_REG_SYS_CTRL2, &tmp);

    /* Enable GPIO/IO functionality by clearing GPIO_OFF bit */
    tmp &= ~(STMPE811_SYS_CTRL2_GPIO_OFF);

    /* Write back - this enables GPIO/IO functionality */
    TS_WriteRegister(hts, STMPE811_REG_SYS_CTRL2, tmp);

    /* Enable Alternate Function for touchscreen pins (GPIO 4-7) */
    TS_ReadRegister(hts, STMPE811_REG_IO_AF, &tmp);
    /* Enable AF for pins 4-7 (TSC pins): clear bits defined by STMPE811_TOUCH_IO_ALL */
    tmp &= ~(STMPE811_PIN_4 | STMPE811_PIN_5 | STMPE811_PIN_6 | STMPE811_PIN_7);
    TS_WriteRegister(hts, STMPE811_REG_IO_AF, tmp);

    /* Now enable TSC and ADC functions in SYS_CTRL2 by clearing their OFF bits */
    //TS_ReadRegister(hts, STMPE811_REG_SYS_CTRL2, &tmp);
    tmp &= ~(STMPE811_SYS_CTRL2_TSC_OFF | STMPE811_SYS_CTRL2_ADC_OFF);
    TS_WriteRegister(hts, STMPE811_REG_SYS_CTRL2, tmp);

     /* Configure ADC - Sample Time, bit number and Reference
         0x49 = BSP setting: 64 sample time, 12-bit, internal reference */
    TS_WriteRegister(hts, STMPE811_REG_ADC_CTRL1, TS_ADC_CTRL_12BIT);

    /* Wait for ADC to stabilize */
    TS_DELAY_MS(2);

    /* Configure ADC clock speed: 3.25 MHz */
    TS_WriteRegister(hts, STMPE811_REG_ADC_CTRL2, 0x01);

    /* Configure touchscreen:
       - 4 samples averaging (0x80)
       - 500us touch detect delay (0x18)
       - 500us panel driver settling time (0x02)
       = 0x9A */
    TS_WriteRegister(hts, STMPE811_REG_TSC_CFG, 0x9A);

    /* Configure FIFO threshold: single point reading */
    TS_WriteRegister(hts, STMPE811_REG_FIFO_TH, 0x01);

    /* Clear the FIFO memory content */
    TS_WriteRegister(hts, STMPE811_REG_FIFO_STA, 0x01U);

    /* Put the FIFO back into operation mode */
    TS_WriteRegister(hts, STMPE811_REG_FIFO_STA, 0x00U);

    /* Set the fractional part and whole part for Z pressure:
       - Fractional part: 7
       - Whole part: 1 */
    TS_WriteRegister(hts, STMPE811_REG_TSC_FRACT_XYZ, 0x01U);

    /* Set the driving capability for TSC pins: 50mA */
    TS_WriteRegister(hts, STMPE811_REG_TSC_I_DRIVE, 0x01U);

     /* Enable touchscreen controller: use BSP default (enable TSC in XYZ mode) */
     TS_WriteRegister(hts, STMPE811_REG_TSC_CTRL, STMPE811_TSC_CTRL_EN);

    /* Clear all pending interrupts */
    TS_WriteRegister(hts, STMPE811_REG_INT_STA, 0xFFU);

    /* Wait for configuration to settle */
    TS_DELAY_MS(2);



    return TS_OK;
}



/**
 * @brief Read raw coordinates from controller

 * @param raw_x Pointer to store raw X coordinate
 * @param raw_y Pointer to store raw Y coordinate
 * @param pressure Pointer to store pressure value
 * @retval TS_StatusTypeDef Status of the operation
 */


static TS_StatusTypeDef TS_ReadRawCoordinates(uint16_t *raw_x,
                                              uint16_t *raw_y,
                                              uint16_t *pressure)
{
    uint8_t data[4] = {0};
    uint32_t xyz = 0;

    if (raw_x == NULL || raw_y == NULL) {
        return TS_INVALID_PARAM;
    }

    if (TS_ReadRegisterMulti(g_hts, STMPE811_REG_TSC_DATA_NON_INC, data, 4) != TS_OK) {
        return TS_COMMUNICATION_ERROR;
    }


    xyz  = ((uint32_t)data[0] << 24);
    xyz |= ((uint32_t)data[1] << 16);
    xyz |= ((uint32_t)data[2] << 8);
    xyz |=  (uint32_t)data[3] << 0;

    /* Extract 12-bit coordinates (STMPE811 datasheet format) */
    *raw_x = (xyz >> 20) & 0x0FFF;
    *raw_y = (xyz >>  8) & 0x0FFF;

    if (pressure != NULL) {
        *pressure = xyz & 0xFF;
    }

    log_debug("Raw X: %u, Raw Y: %u, Pressure: %u", *raw_x, *raw_y, pressure ? *pressure : 0);

    /* Reset FIFO (mandatory after reading) */
    TS_WriteRegister(g_hts, STMPE811_REG_FIFO_STA, 0x01);
    TS_WriteRegister(g_hts, STMPE811_REG_FIFO_STA, 0x00);

    return TS_OK;
}


/**
 * @brief Filter coordinates using threshold-based update (matches working project)
 * @param hts Pointer to touchscreen handle structure
 * @param xPos Pointer to X coordinate
 * @param yPos Pointer to Y coordinate
 */
//
static void TS_FilterCoordinates(uint16_t *x,
                                 uint16_t *y)
{
    static uint16_t _x = 0;
    static uint16_t _y = 0;

    int32_t x_raw = (int32_t)*x;
    int32_t y_raw = (int32_t)*y;

