Ekpenyong-Esu/STM32F429I_DISC1_CMAKE_PROJECT/Peripherals/TOUCHSCREEN/touchscreen.c
    int32_t xDiff = x_raw > _x ? (x_raw - _x) : (_x - x_raw);
    int32_t yDiff = y_raw > _y ? (y_raw - _y) : (_y - y_raw);

    /* Threshold-based smoothing (matches working project) */
    if ((xDiff + yDiff) > 5) {
        _x = (uint16_t)x_raw;
        _y = (uint16_t)y_raw;
    }

    *x = _x;
    *y = _y;

    log_debug("Filter X = %u, Filter Y = %u", *x, *y);
}

/**
 * @brief Analyze gesture from touch data
 * @param hts Pointer to touchscreen handle structure
 * @retval TS_GestureTypeDef Detected gesture
 */
static TS_GestureTypeDef TS_AnalyzeGesture(TS_HandleTypeDef *hts)
{
    /* Basic gesture recognition - can be enhanced */

    if (hts->TouchData.TouchCount == 0 && hts->PrevTouchData.TouchCount > 0) {
        /* Touch released */
        uint32_t touch_duration = HAL_GetTick() - hts->PrevTouchData.Points[0].Timestamp;

        if (touch_duration > TS_LONG_PRESS_TIME) {
            return TS_GESTURE_LONG_PRESS;
        }
        return TS_GESTURE_TAP;
    }

    if (hts->TouchData.TouchCount > 0 && hts->PrevTouchData.TouchCount > 0) {
        /* Calculate movement */
        int16_t deltaX = (int16_t)(hts->TouchData.Points[0].X - hts->PrevTouchData.Points[0].X);
        int16_t deltaY = (int16_t)(hts->TouchData.Points[0].Y - hts->PrevTouchData.Points[0].Y);
        uint16_t distance = (uint16_t)sqrt((double)(deltaX*deltaX + deltaY*deltaY));

        if (distance > TS_GESTURE_THRESHOLD) {
            if (abs(deltaX) > abs(deltaY)) {
                return (deltaX > 0) ? TS_GESTURE_SWIPE_RIGHT : TS_GESTURE_SWIPE_LEFT;
            }
            return (deltaY > 0) ? TS_GESTURE_SWIPE_DOWN : TS_GESTURE_SWIPE_UP;
        }
    }

    return TS_GESTURE_NONE;
}

/**
 * @brief Check if touch is valid based on pressure
 * @param pressure Pressure value
 * @retval bool True if valid touch
 */
